const title = ['太聪明', '栞', '做个小孩', '呓语', '湘江中路', '我也曾想过一了百了', '空之箱','Afterglow','我看了56次日落'];
const singer = ['陈绮贞', 'MyGO!!!!!', '孟慧圆', '毛不易', '庄达菲', 'amazarashi', 'トゲナシトゲアリ','蔡徐坤','黑加伦'];
const music = ['music/陈绮贞 - 太聪明.mp3', 'music/MyGO!!!!! - 栞.mp3', 'music/孟慧圆 - 做个小孩.mp3',
    'music/毛不易 - 呓语.mp3', 'music/庄达菲 - 湘江中路.mp3', 'music/amazarashi - 僕が死のうと思ったのは.mp3',
    'music/トゲナシトゲアリ - 空の箱 (井芹仁菜、河原木桃香).mp3','music/蔡徐坤 - Afterglow.mp3','music/黑加伦 - 我看了56次日落.mp3'];
const cover = ['img/太聪明.png', 'img/栞.png', 'img/做个小孩.png', 'img/呓语.png', 'img/湘江中路.png',
    'img/我也曾想过一了百了.png', 'img/空之箱.png','img/Afterglow.png','img/我看了56次日落.png'];
const foreign = [0, 3, 0, 0, 0, 2, 3, 0, 0];
let time = [], lyrics = [], size = [];
let showTime = [];
const lrc = [
//太聪明    
`[00:00.00] 作词 : 陈绮贞
[00:01.00] 作曲 : 陈绮贞
[00:02.00] 编曲 : 钟成虎
[00:03.00] 制作人 : 陈绮贞
[00:07.58]总以为谜一般难懂的我
[00:14.09]在你了解了以后 其实也没什么
[00:21.28]我总是忽冷又忽热隐藏我的感受
[00:28.47]只是怕爱你的心被你看透
[00:40.11]猜的没错想得太多不会有结果
[00:46.77]被你看穿了以后我更无处可躲
[00:54.05]我开始后悔不应该太聪明的卖弄
[01:01.10]只是怕亲手将我的真心葬送
[01:12.35]我猜着你的心
[01:16.20]要再一次确定
[01:19.91]遥远的距离都是因为太过聪明
[01:27.05]要猜着你的心
[01:30.97]要再一次确定
[01:34.41]混乱的思绪都是因为太想靠近你
[01:42.27]猜的没错想得太多不会有结果
[01:48.57]被你看穿了以后我更无处可躲
[01:55.77]我开始后悔不应该太聪明的卖弄
[02:02.97]只是怕亲手将我的真心葬送
[02:46.99]我猜着你的心
[02:50.73]要再一次确定
[02:54.41]遥远的距离都是因为太过聪明
[03:01.63]要猜着你的心
[03:05.10]要再一次确定
[03:09.00]混乱的思绪都是因为太想靠近你
[03:16.85]猜的没错想得太多不会有结果
[03:23.26]被你看穿了以后我更无处可躲
[03:30.40]我开始后悔不应该太聪明的卖弄
[03:37.56]只是怕亲手将我的真心葬送
[03:44.93]只是怕亲手将我的真心葬送
[03:52.46]我开始后悔不应该太聪明的卖弄
[03:59.24]只是怕亲手将我的真心葬送
[04:05.80]制作人：林暐哲
[04:06.20]木吉他：钟成虎
[04:06.58]Chamberlin Oboe：陈绮贞
[04:06.97]录音师：林暐哲、蔡坤奇
[04:07.21]录音室：林暐哲音乐社
[04:07.44]混音师：林暐哲
[04:07.67]混音室：林暐哲音乐社
[04:08.02]制作助理：郑瀚椲、蔡坤奇
[04:08.39]OP: Rock Music Publishing (Taiwan) Co., Ltd.
[04:08.62]ISRC TWB870211302
[04:08.81]Executive Producer : 林暐哲
[04:09.08]Publisher : Sam Duann`, 
//MyGo！！!
`[00:00.000] 作词 : 織田あすか
[00:00.455] 作曲 : 藤田淳平
[00:00.910] 编曲 : 藤田淳平
[00:01.366]“普通”とか”あたりまえ”ってなんだろう
[00:07.017]今 手にある物差しでは
[00:09.788]全然上手く測れなくって
[00:12.950]吐いては また吸い込んだ不安に
[00:17.982]僕は為すがまま立ち尽くして
[00:23.237]不器用で 空回って
[00:26.263]傷つくことから逃げている
[00:30.071]現実とノートで行ったり来たり 慰めて
[00:40.289]あぁ なんて生きづらい世界なんだろう
[00:46.350]だけど だけど
[00:49.906]ぜんぶ ぜんぶ 僕だから
[00:52.471]うじうじ しくしく 僕だから
[00:55.478]ぜんぶ ぜんぶ 抱きしめて少し眠ろう
[01:00.670]痛いの痛いの飛んでゆけ
[01:03.572]悲しみにすべてを奪われないように
[01:07.399]僕は 僕の味方でいようよ
[01:12.867]まだまだ長い道の途中
[01:16.948]ちょっとくらい休憩したって
[01:22.383]誰にも叱られはしないから
[01:41.090]人の顔色をうかがいながら
[01:46.819]流されるままに衣食住
[01:49.592]…僕は何がしたいんだろう
[01:52.716]こんなにも惨めで 情けなくても
[01:57.695]僕はまだ自分を変えられそうにない
[02:02.974]気弱で 八方美人
[02:06.019]嫌われることを恐れている
[02:09.769]現実とノートで行ったり来たり 励まして
[02:19.981]あぁ なんて生きづらい世界なんだろう
[02:26.178]だけど だけど
[02:29.461]ぜんぶ ぜんぶ 僕だから
[02:32.136]いじいじ めそめそ 僕だから
[02:34.909]ぜんぶ ぜんぶ 抱きしめて少し眠ろう
[02:40.456]痛いの痛いの飛んでゆけ
[02:42.954]物事になんでもかんでも意味を見出さなくたっていいからさ
[02:54.632]信じてもいいのかな?【いいよ】
[02:59.944]ここにいてもいいのかな?【いいよ】
[03:05.002]頑張りすぎないように
[03:07.599]気づいた時でいい
[03:10.099]自分自身を優しく受け止めて
[03:26.749]ぜんぶ ぜんぶ 僕だから
[03:29.405]うじうじ しくしく 僕だから
[03:32.217]ぜんぶ ぜんぶ 抱きしめて少し眠ろう
[03:37.704]痛いの痛いの飛んでゆけ
[03:40.325]悲しみにすべてを奪われないように
[03:44.226]僕は 僕の味方でいようよ
[03:49.627]たった一度の僕の人生
[03:53.825]愛するかどうかは 僕次第
[03:59.234]だとしたら精一杯に
[04:07.771]あぁ 言葉はみずみずしく光るよ
[04:13.913]だから だから`, 
//做一个小孩
`[00:00.00] 词 Lyricist : 黄智毅
[00:00.89] 曲 Composer : 黄智毅
[00:01.78] 制作人 Producer : 闫泽欢
[00:02.67] 编曲 Arrangement : 闫泽欢@DPS
[00:03.56] 钢琴 Piano : 闫泽欢
[00:04.45] 键盘 Keyboard : 赵二
[00:05.34] 和声 Background Vocalist : Alpha Gun@DPS
[00:06.23] 混音 Mixing Engineer : 一丁@DPS
[00:07.12] 混音助理 Mixing Assistance : 齐羽@DPS
[00:08.01] 母带 Mastering Engineer : Alexandr Vatagin (Vienna/Austria）
[00:08.91] 配唱制作人 Vocal Producer : 闫泽欢
[00:09.80] 人声编辑 Vocal Editing : 袁栋@DPS
[00:10.69] 制作协助 Production assistance : koukou@DPS
[00:11.58] 制作团队Production team : DPS
[00:12.47] 录音师Recording Engineer : 少天
[00:13.36] 录音室Recoding Studio : 录顶技
[00:14.25]  （版权声明：未经许可，不得翻唱或使用）
[00:15.15]时间的海 孤独的白
[00:22.08]随波逐流 谁会更自在
[00:29.04]若是发现 缺了一块
[00:35.76]习惯地涂上浓艳色彩
[00:41.28]
[00:41.52]被依赖 被期待
[00:47.43]被勇敢 被放在温室之外
[00:55.14]要累坏 记得要振作起来
[01:02.70]找片花海 再对自己表白
[01:09.24]做个小孩
[01:11.85]每天自由自在
[01:15.33]无聊看看钟摆
[01:18.72]感受时间慢慢离开
[01:22.56]慢慢学会爱
[01:25.65]酝酿一场幼稚的告白
[01:30.30]不需要成败
[01:32.88]单纯因为喜欢
[01:36.38]
[01:36.69]我是小孩
[01:39.27]走路大摇大摆
[01:42.69]从不用担心
[01:45.33]会失去谁的爱
[01:50.40]还不明白
[01:52.95]坠入人海
[01:55.98]孤独是常态
[01:59.18]
[02:17.46]被依赖 被期待
[02:23.43]被勇敢 被放在温室之外
[02:31.14]要累坏 记得要振作起来
[02:38.61]找片花海 再对自己表白
[02:44.90]
[02:45.27]做个小孩
[02:47.85]每天自由自在
[02:51.33]无聊看看钟摆
[02:54.69]感受时间慢慢离开
[02:58.53]慢慢学会爱
[03:01.62]酝酿一场幼稚的告白
[03:06.27]不需要成败
[03:08.88]单纯因为喜欢
[03:12.62]
[03:12.72]我是小孩
[03:15.24]走路大摇大摆
[03:18.69]从不用担心
[03:21.36]会失去谁的爱
[03:27.60]还不明白
[03:30.54]坠入人海
[03:33.72]孤独是常态
[03:37.22]`, 
//呓语
`[00:00.000] 作词 : 毛不易
[00:00.533] 作曲 : 毛不易
[00:01.066] 编曲 : 福禄寿FloruitShow/韦伟
[00:01.599] 制作人 : 韦伟
[00:02.132] 吉他 : 刘磊Liu Lei
[00:02.665] 贝斯 : 韩阳Han Yang
[00:03.198] 鼓 : 德恒De Heng
[00:03.731] 键盘 : 韦伟Oldbanana
[00:04.264] 配唱制作人 : 何文锐He WenRui@光合声动
[00:04.797] 和声 : 何文锐He WenRui@光合声动
[00:05.330] 录音 : 李越Li Yue@摩登天空ModernSky
[00:05.863] 人声编辑 : 祝薇Avi Zhu
[00:06.396] 混音 : 李越Li Yue@野火春风EFO Sound
[00:18.036]一段未醒
[00:19.913]又做一段
[00:22.163]如果这画面有开关
[00:26.423]从期待走到不堪
[00:29.599]结局不好看
[00:32.936]人总需要记住遗憾
[00:36.558]它来过 它走了
[00:45.180]没回头 没问过
[00:48.175]你可舍得
[00:53.178]
[00:53.613]日月蹉跎
[00:55.442]小起大落
[00:57.672]光阴里有多少景色
[01:02.111]偶尔也心口一热
[01:05.193]什么都不说
[01:08.447]好过亲手把它撕破
[01:12.397]路还长 梦还多
[01:21.516]被这话 欺骗的
[01:23.647]何止你我
[01:28.754]
[01:29.105]可是我现在依然不太会转弯
[01:32.656]虽然孤单的人偶尔也想有个伴
[01:37.356]冷风又吹的时候想说
[01:40.683]这生活会不会有点难
[01:46.486]难道是因为当初有话没讲完
[01:50.537]堵在喉咙里却始终不敢大声喊
[01:54.917]算了 别哭
[02:03.005]
[02:22.651]日月蹉跎
[02:24.366]小起大落
[02:26.559]光阴里有多少景色
[02:31.000]偶尔也心口一热
[02:34.200]什么都不说
[02:37.274]好过亲手把它撕破
[02:41.196]路还长 梦还多（不多）
[02:50.126]被这话 欺骗的
[02:52.473]何止你我
[02:57.457]
[02:57.694]可是我现在依然不太会转弯
[03:01.595]虽然孤单的人偶尔也想有个伴
[03:06.385]冷风又吹的时候想说
[03:09.254]这生活会不会有点难
[03:15.380]难道是因为当初有话没讲完
[03:19.428]堵在喉咙里却始终不敢大声喊
[03:24.119]算了 别哭
[03:30.706]
[03:31.008]可是我偏偏就是不想要转弯
[03:34.909]就算不开灯的房间真的有些暗
[03:39.705]夜色又来的时候想说
[03:42.562]为什么只留给我一半
[03:48.569]难道是因为出现的人都伪善
[03:52.840]擅长告别擅长躲闪擅长分两端
[03:57.457]算了 别哭`,
//湘江中路
`[00:00.000] 作词 : 庄达菲
[00:01.000] 作曲 : 庄达菲
[00:02.000] 编曲 : 李宗轩@Cox Soundtrack
[00:03.000] 制作人 : Monkey（郭时伊） 张琨
[00:11.660]
[00:14.052]风带着潮湿
[00:18.563]水在讲故事
[00:22.545]无处停留的我
[00:25.470]绕着江若无其事
[00:29.186]
[00:29.986]三两人经过
[00:33.435]路中央有人在唱歌
[00:37.420]我蹲下听着
[00:40.604]她也望向我
[00:44.331]
[00:44.859]在这个无人问津的夜
[00:48.843]你是否还记得自己曾快乐
[00:52.564]快乐地站在山顶呐喊
[00:56.282]日出多值得
[01:00.005]在这个无人问津的夜
[01:03.986]你是否还记得自己多失落
[01:07.698]失落地望着来往的车
[01:15.615]都只是路过
[01:16.680]
[01:18.271]风带着潮湿
[01:23.054]水在讲故事
[01:27.041]无处停留的我
[01:30.231]绕着江若无其事
[01:33.942]
[01:34.480]三两人经过
[01:38.198]路中央有人在唱歌
[01:42.446]我蹲下听着
[01:46.166]她也望向我
[01:49.351]
[01:49.879]在这个无人问津的夜
[01:54.134]你是否还记得自己曾快乐
[01:58.120]快乐地站在山顶呐喊
[02:02.108]日出多值得
[02:05.560]在这个无人问津的夜
[02:09.270]你是否还记得自己多失落
[02:13.254]失落地望着来往的车
[02:17.238]都只是路过
[02:27.863]
[02:29.726]在这个无人问津的夜
[02:48.054]你是否还记得自己曾快乐
[02:51.510]快乐地站在山顶呐喊
[02:55.234]日出多值得
[02:59.206]在这个无人问津的夜
[03:03.198]你是否还记得自己多失落
[03:06.912]失落地望着来往的车
[03:15.151]都只是路过
[03:41.595] 音乐监制 : 李若溪
[03:42.011] 吉他 : 李宗轩
[03:42.427] 和声编唱 : 李若溪 Monkey（郭时伊）
[03:42.843] 混音/母带 : 李宗轩
[03:43.259] 人声录音 : 李宗远
[03:43.675] 人声录音室 : Studio21 A
[03:44.091] 制作监制 : 郝浚紊
[03:44.507] 制片 : 曾祥森@Cox Soundtrack
[03:44.923] 音乐制作 : Cox Soundtrack
[03:45.339] 发行 : 北京创娱无界文化发展有限公司
[03:45.755] SP : 北京创娱无界文化发展有限公司`, 
//我也想过一了百了
`[00:00.00] 作词 : 秋田ひろむ
[00:01.00] 作曲 : 秋田ひろむ
[00:22.96]僕が死のうと思ったのは
[00:28.70]ウミネコが桟橋で鳴いたから
[00:34.25]波の随意に浮かんで消える
[00:40.21]過去も啄ばんで飛んでいけ
[00:45.85]僕が死のうと思ったのは
[00:52.11]誕生日に杏の花が咲いたから
[00:57.29]その木漏れ日でうたた寝したら
[01:03.24]虫の死骸と土になれるかな
[01:09.66]薄荷飴 漁港の灯台
[01:12.25]錆びたアーチ橋 捨てた自転車
[01:15.15]木造の駅のストーブの前で
[01:18.38]どこにも旅立てない心
[01:21.30]今日はまるで昨日みたいだ
[01:23.85]明日を変えるなら今日を変えなきゃ
[01:27.2]分かってる 分かってる けれど
[01:32.14]僕が死のうと思ったのは
[01:37.97]心が空っぽになったから
[01:43.61]満たされないと泣いているのは
[01:49.64]きっと満たされたいと願うから
[02:18.56]僕が死のうと思ったのは
[02:24.70]靴紐が解けたから
[02:29.97]結びなおすのは苦手なんだよ
[02:36.16]人との繋がりもまた然り
[02:41.56]僕が死のうと思ったのは
[02:47.69]少年が僕を見つめていたから
[02:52.92]ベッドの上で土下座してるよ
[02:59.10]あの日の僕にごめんなさいと
[03:04.97]パソコンの薄明かり
[03:07.36]上階の部屋の生活音
[03:10.32]インターフォンのチャイムの音
[03:13.29]耳を塞ぐ鳥かごの少年
[03:16.45]見えない敵と戦ってる
[03:18.83]六畳一間のドンキホーテ
[03:22.26]ゴールはどうせ醜いものさ
[03:27.40]僕が死のうと思ったのは
[03:33.52]冷たい人と言われたから
[03:38.74]愛されたいと泣いているのは
[03:44.96]人の温もりを知ってしまったから
[04:13.80]僕が死のうと思ったのは
[04:19.85]あなたが綺麗に笑うから
[04:25.4]死ぬことばかり考えてしまうのは
[04:31.13]きっと生きる事に真面目すぎるから
[04:39.22]僕が死のうと思ったのは
[04:45.0]まだあなたに出会ってなかったから
[04:50.34]あなたのような人が生まれた
[04:56.57]世界を少し好きになったよ
[05:02.25]あなたのような人が生きてる
[05:08.48]世界に少し期待するよ`, 
//空之箱
`[00:00.000] 作词 : 松原 さらり
[00:00.122] 作曲 : 南田健吾
[00:00.244] 编曲 : 玉井健二/南田健吾
[00:00.367] やけに白いんだ　やたら長いんだ
[00:03.644] コタエはだいたいカタチばかりの常識だろう
[00:09.010] 指先が震えようとも
[00:13.460] 地図にはないはずの三叉路に今
[00:17.978] ぶつかっているのですが
[00:20.274] 何を頼りに進めばいいのでしょうか
[00:27.058] 教科書通りとはよく言ったもので
[00:30.618] 難しい言葉だらけ
[00:32.984] 今日(こんにち)あの頃から少しも変わらない
[00:39.785] この空欄を埋めれば解けますか　いつの日か
[00:46.639] あなたならどうやって先へと進みますか
[00:52.207] やけに白いんだ　やたら長いんだ
[00:55.609] コタエはだいたいカタチばかりの常識だろう
[01:00.826] 指先が震えようとも
[01:05.204] 正解は無いんだ　負けなんて無いんだ
[01:08.535] あたしは生涯　あたしであってそれだけだろう
[01:13.829] これ以上かき乱しても明日はない
[01:24.931] 役立たない地図の所為にして今
[01:29.250] 途方に暮れていますが
[01:31.636] 強がったとして結果はおそらく同じ
[01:38.494] 溢れだしそうなほど詰め込んだ
[01:41.847] 他人の箱を横目に
[01:44.227] 下手な愛想笑いすら　やっぱり出来てない
[01:51.057] こんな空欄さえなければ　あなたも思うでしょう
[01:57.981] このままでいいなんて　それだけは間違いだ
[02:18.282] 空っぽなんだ　ひとつも無いんだ
[02:21.426] 無くなったのか　始まったのか分からないけど
[02:26.847] 行くしか方法は無いんだろう？
[02:31.132] 正解がなんだ　価値なんて無いんだ
[02:34.432] あたしは生涯　あたし以外じゃ生きられないよ
[02:39.694] これ以上かき乱しても明日はない
[02:54.376] どう足掻いても明日はない`,
//Afterglow
`[00:00.00]Afterglow - 蔡徐坤
[00:02.54]词：蔡徐坤/Max Ulver/Daniel Schulz
[00:03.86]曲：蔡徐坤/Max Ulver/Daniel Schulz
[00:05.94]编曲：蔡徐坤/Max Ulver/Christian Coer/Jeffrey Z./Jordan Reifkind
[00:07.14]制作人：蔡徐坤/Max Ulver/Christian Coer/Jeffrey Z.
[00:12.46]In all these faces
[00:14.48]I see you
[00:20.74]No hesitation
[00:23.18]Only you
[00:27.94]You're a blue swimming pool
[00:31.80]We could dance in the middle of June
[00:36.62]Let a new flower bloom
[00:40.46]We could dance in the middle of June
[00:45.46]In the afterglow
[00:49.37]Nothing lasts forever
[00:54.18]In the afterglow
[00:58.06]Nothing lasts forever
[01:13.01]All this temptation
[01:15.59]I fall through
[01:21.61]What are we chasing
[01:24.37]Got no clue
[01:28.98]So I go with the flow
[01:32.75]We could dance in the middle of June
[01:37.74]Let a new flower bloom
[01:41.47]We could dance in the middle of June
[01:46.38]In the afterglow
[01:50.50]Nothing lasts forever
[01:55.18]In the afterglow
[01:59.30]Nothing lasts forever
`,
//
`[00:00.52]我看了56次日落 - 黑加伦
[00:02.03]词：黑加伦
[00:03.64]曲：黑加伦
[00:05.63]编曲：raspo
[00:07.25]和声设计：黑加伦
[00:09.29]混音：黑加伦
[00:10.60]母带：冯畴锜
[00:11.34]OP/SP：广州大酱文化发展有限公司
[00:12.12]（已购买beat使用权）
[00:25.43]夜再没有星点亮
[00:26.73]阴霾笼罩在大地上
[00:28.61]太阳下山后
[00:29.72]我还朝着日落西山的方向望
[00:31.71]心关上 等天亮
[00:33.22]可过去你叫我怎么忘
[00:34.62]我克制自己就别再想
[00:36.25]可日落后 情绪怎么藏
[00:38.06]我的世界早就没有日落
[00:39.65]失去你后太阳就没来过
[00:41.26]我假装自己很振作
[00:42.83]把痛苦全部给夕阳说
[00:44.60]这次我不争气又喝多了
[00:46.19]只是想快点将你摆脱
[00:47.76]晕晕乎乎的睡着
[00:48.93]梦里面却有你的轮廓
[00:51.00]我不甘心
[00:52.02]我以为距离不会影响我们之间关系
[00:55.22]为我们的未来铺好路我就回来找你
[00:58.43]给你发的一堆挽回的短信
[01:00.83]我不争气
[01:01.70]我说只要你回头他的出现我不在意
[01:05.00]我望着你没有眨眼
[01:06.23]是怕眼泪突然落下
[01:08.07]我怕你听到我的哭腔
[01:09.33]所以我并没有说话
[01:11.30]不管我说什么依然也会被抛下 对吗
[01:14.60]最后像以前一样将就你
[01:16.44]顺从你的想法
[01:17.81]我看了不止五十六次的日落
[01:20.67]他们像你一样
[01:21.82]抓不住只能在我的相册
[01:24.53]到底要怎么样我才能摆脱
[01:27.74]你忘了我们曾经的承诺
[01:29.46]夜再没有星点亮
[01:31.02]阴霾笼罩在大地上
[01:32.51]太阳下山后
[01:33.66]我还朝着日落西山的方向望
[01:35.74]心关上 等天亮
[01:37.23]可过去你叫我怎么忘
[01:38.82]我克制自己就别再想
[01:40.46]可日落后 情绪怎么藏
[01:42.14]日落过后
[01:43.33]眼泪让这夜晚变的潮湿
[01:45.35]你执意要走
[01:46.54]过去点点滴滴瞬间交织
[01:48.53]不是说非要看日落
[01:49.79]也不是非你不可
[01:51.65]只是晚霞渲染出的这片温柔
[01:53.74]我以为你也会停留
[01:55.43]日出到日落的过程
[01:56.56]像是我们相爱再到陌生
[01:58.13]分开的理由我也不再过问
[01:59.76]回头看每个细节都是佐证
[02:01.35]我只能默认
[02:02.92]这场游戏你最终获胜
[02:04.50]不合适打败了我们
[02:05.70]感叹造化弄人
[02:06.86]我留下了裂痕
[02:08.07]五点半我打开了窗帘
[02:09.32]点根烟我坐在了床边
[02:10.86]看着床头你给我的项链
[02:12.57]这个时刻我被击破了防线
[02:14.13]不自觉又看着我们的相片
[02:15.76]又想起了分开的场面
[02:17.33]夕阳溜进了我的房间
[02:18.93]夜幕快要降临它苟延残喘
[02:20.58]夜再没有星点亮
[02:22.03]阴霾笼罩在大地上
[02:23.78]太阳下山后
[02:24.88]我还朝着日落西山的方向望
[02:26.91]心关上 等天亮
[02:28.46]可过去你叫我怎么忘
[02:30.06]我克制自己就别再想
[02:31.67]可日落后 情绪怎么藏
[02:33.66]夜再没有星点亮
[02:34.83]阴霾笼罩在大地上
[02:36.51]太阳下山后
[02:37.69]我还朝着日落西山的方向望
[02:39.70]心关上 等天亮
[02:41.19]可过去你叫我怎么忘
[02:42.83]我克制自己就别再想
[02:44.42]可日落后 情绪怎么藏
[02:46.12]我不甘心
[02:47.28]我以为距离不会影响我们之间关系
[02:50.46]为我们的未来铺好路我就回来找你
[02:53.64]给你发的一堆挽回的短信
[02:55.85]我不争气
[02:56.88]可你的回答比我们恋爱时还要坚定
[03:00.11]我望着你没有眨眼
[03:01.39]是怕眼泪突然落下
[03:03.36]我怕你听到我的哭腔
[03:04.59]所以我并没有说话
[03:06.92]不管我说什么依然也会被抛下 对吗
[03:09.70]最后像以前一样将就你
[03:11.89]顺从你的想法
[03:12.69]夜再没有星点亮
[03:13.30]阴霾笼罩在大地上
[03:14.95]太阳下山后
[03:16.07]我还朝着日落西山的方向望
[03:18.12]心关上 等天亮
[03:19.63]可过去你叫我怎么忘
[03:21.29]我克制自己就别再想
[03:22.83]可日落后 情绪怎么藏
`];
const translation = ['', `作词 : 織田あすか，
作曲 : 藤田淳平，
编曲 : 藤田淳平。
“普通”とか”あたりまえ”ってなんだろう，
“普通”“理所当然”什么的是什么呢，
今 手にある物差しでは，
就拿出现在手里拥有的所有东西，
全然上手く測れなくって，
也无法好好的测量出来，
吐いては また吸い込んだ不安に，
无计可施地滞足在原地，
僕は為すがまま立ち尽くして，
将不安从口中吐出又再次吸入，
不器用で 空回って，
不成器地兜兜转转，
傷つくことから逃げている，
想从创伤中逃走，
現実とノートで行ったり来たり 慰めて，
不断在现实与笔记本的小小世界中穿行 以求得安慰，
あぁ なんて生きづらい世界なんだろう，
啊啊 为什么这世界是这样的难以生存呢，
だけど だけど，
但是 但是，
ぜんぶ ぜんぶ 僕だから，
因为这全部全部都是我啊，
うじうじ しくしく 僕だから，
一直犹豫不决 抽抽噎噎的是我啊，
ぜんぶ ぜんぶ 抱きしめて，
所以我会将这些全部全部都拥入怀中，
少し眠ろう，
小睡一会，
痛いの痛いの飛んでゆけ，
痛痛全都飞走吧，
悲しみにすべてを奪われないように，
祈愿着就这样把悲伤全都夺走吧，
僕は 僕の味方でいようよ，
只要我是我自己的同伴就好了，
まだまだ長い道の途中，
因为还处在漫长的旅途中，
ちょっとくらい休憩したって，
所以稍微休息一下，
誰にも叱られはしないから，
也不会被任何人责备吧，
人の顔色をうかがいながら，
观察着别人的脸色，
流されるままに衣食住，
就那样随波逐流地吃穿住，
…僕は何がしたいんだろう，
…我到底想要做什么呢，
こんなにも惨めで 情けなくても，
即便如此悲惨可怜，
僕はまだ自分を変えられそうにない，
自己也好像毫无改变的样子，
気弱で 八方美人，
软弱地迎合着别人，
嫌われることを恐れている，
恐惧着被人讨厌这件事，
現実とノートで行ったり来たり 励まして，
不断在现实与笔记本的小小世界中穿行以求得鼓励，
あぁ なんて生きづらい世界なんだろう，
啊啊 为什么这世界是这样的难以生存呢，
だけど だけど，
但是 但是，
ぜんぶ ぜんぶ 僕だから，
因为 这全部全部都是我啊，
いじいじ めそめそ 僕だから，
一直畏手畏脚 低声抽泣的是我啊，
ぜんぶ ぜんぶ 抱きしめて少し眠ろう，
所以我会将这些全部全部拥入怀中小睡一会，
痛いの痛いの飛んでゆけ，
痛痛全都飞走吧，
物事になんでもかんでも意味を見出さなくたっていいからさ，
就算不把事物的意义全部找出来也可以啊，
信じてもいいのか な?（いいよ），
相信你也可以吗？（可以哟），
ここにいてもいいのかな?（いいよ），
只是待在这里也可以吗？（可以哟），
頑張りすぎないように，
不用那么努力也可以，
気づいた時でいい，
意识到这样就好，
自分自身を優しく受け止めて，
温柔地将自己接受，
ぜんぶ ぜんぶ 僕だから，
因为这全部全部都是我啊，
うじうじ しくしく 僕だから，
一直犹豫不决 抽抽噎噎的是我啊，
ぜんぶ ぜんぶ 抱きしめて少し眠ろう，
所以我会将这些全部全部拥入怀中小睡一会，
痛いの痛いの飛んでゆけ，
痛痛全都飞走吧，
悲しみにすべてを奪われないように，
祈愿着就这样把悲伤全都夺走吧，
僕は 僕の味方でいようよ，
只要我是我自己的同伴就好了，
たった一度の僕の人生，
仅此一次的我的人生，
愛するかどうかは 僕次第，
爱与不爱都取决于我，
だとしたら精一杯に，
但是 如果竭尽全力活下去的话，
あぁ 言葉はみずみずしく光るよ，
啊啊 话语就会鲜活地闪耀起来了啊，
だから だから，
所以 所以。`, '', '', '', `作词: 秋田ひろむ，
作曲: 秋田ひろむ，
僕が死のうと思ったのは，
我也曾想过一死了之，
ウミネコが桟橋で鳴いたから，
只因黑尾鸥在码头鸣泣，
波の随意に浮かんで消える，
随波逐流 就此消逝，
過去も啄ばんで飛んでいけ，
将吾过往 衔走远去，
僕が死のうと思ったのは，
我也曾想过一死了之，
誕生日に杏の花が咲いたから，
只因出生那天杏花绽放，
その木漏れ日でうたた寝したら，
躺在穿透树荫的日光下，
虫の死骸と土になれるかな，
是否就会与虫骸一起化为尘土，
薄荷飴 漁港の灯台，
薄荷味糖果 渔港的灯塔，
錆びたアーチ橋 捨てた自転車，
锈蚀的拱桥 弃置的单车，
木造の駅のストーブの前で，
伫立在木质车站火炉前，
どこにも旅立てない心，
竟遍是无心出行的旅人，
今日はまるで昨日みたいだ，
今天还仿佛昨日模样，
明日を変えるなら今日を変えなきゃ，
欲改变明天 必先在今日做出改变，
分かってる 分かってる けれど，
我懂的 我懂的啊，
僕が死のうと思ったのは，
我也曾想过一死了之，
心が空っぽになったから，
只因内心空虚难捱，
満たされないと泣いているのは，
若心中未被填满 便泪如雨下，
きっと満たされたいと願うから，
一定是因为自己期许过高，
僕が死のうと思ったのは，
我也曾想过一死了之，
靴紐が解けたから，
只因鞋带松弛开散，
結びなおすのは苦手なんだよ，
而我又不擅长系紧，
人との繋がりもまた然り，
无论是鞋带 抑或是与人的羁绊，
僕が死のうと思ったのは，
我也曾想过一死了之，
少年が僕を見つめていたから，
只因曾被少年注视良久，
ベッドの上で土下座してるよ，
在我的床前双膝跪地，
あの日の僕にごめんなさいと，
只想向当时的我 道声抱歉，
パソコンの薄明かり，
电脑的微弱光亮，
上階の部屋の生活音，
楼上的日常声响，
インターフォンのチャイムの音，
内线电话的铃声，
耳を塞ぐ鳥かごの少年，
堵住双耳的笼中少年，
見えない敵と戦ってる，
和无形的敌人战斗着，
六畳一間のドンキホーテ，
一如身处六榻房间的唐吉诃德，
ゴールはどうせ醜いものさ，
自己的目的 总归是残酷可笑的，
僕が死のうと思ったのは，
我也曾想过一死了之，
冷たい人と言われたから，
只因被人冷嘲热讽，
愛されたいと泣いているのは，
低声啜泣 渴望着被爱，
人の温もりを知ってしまったから，
只因知晓了人性的温暖，
僕が死のうと思ったのは，
我也曾想过一死了之，
あなたが綺麗に笑うから，
只因你笑的如此灿烂，
死ぬことばかり考えてしまうのは，
一心只想离开这世界的我，
きっと生きる事に真面目すぎるから，
一定是对生活过于认真了，
僕が死のうと思ったのは，
我也曾想过一死了之，
まだあなたに出会ってなかったから，
只因那时 还未与你相遇，
あなたのような人が生まれた，
有像你这样 美好的人出现，
世界を少し好きになったよ，
我才会对这世界 稍有好感，
あなたのような人が生きてる，
有像你这样 美好的人存在，
世界に少し期待するよ，
我才会对这世界 稍有期待。`, `作词: 松原 さらり，
作曲: 南田健吾，
编曲: 玉井健二/南田健吾，
やけに白いんだ　やたら長いんだ，
提交的试卷空白 可混乱思绪冗长，
コタエはだいたいカタチばかりの常識だろう，
所谓的答案 大概也只是形式上的常识罢了，
指先が震えようとも，
纵使指尖颤抖，
地図にはないはずの三叉路に今，
在这地图并未记载的三岔路口，
ぶつかっているのですが，
我们会相互邂逅吗，
何を頼りに進めばいいのでしょうか，
我们该依靠什么前行才好呢，
教科書通りとはよく言ったもので，
老师常言教科书上的才是正确答案，
難しい言葉だらけ，
可上面皆是难懂的话语，
今日(こんにち)あの頃から少しも変わらない，
我们从过去至此都毫无改变，
この空欄を埋めれば解けますか　いつの日か，
将这空格填上的话 之后就能解开吗，
あなたならどうやって先へと進みますか，
你会做何抉择 是要继续前行吗，
やけに白いんだ　やたら長いんだ，
提交的试卷空白 可混乱思绪冗长，
コタエはだいたいカタチばかりの常識だろう，
所谓的答案 大概也只是形式上的常识罢了，
指先が震えようとも，
纵使指尖颤抖，
正解は無いんだ　負けなんて無いんだ，
人生没有正确答案 所以没有什么败北，
あたしは生涯　あたしであってそれだけだろう，
我今生今世都依旧是我 仅此而已啊，
これ以上かき乱しても明日はない，
再继续涂写下去 也没有明日，
役立たない地図の所為にして今，
因为这张没用的地图，
途方に暮れていますが，
我们才束手无策吗，
強がったとして結果はおそらく同じ，
逞强的结果也许还是相同的，
溢れだしそうなほど詰め込んだ，
将自己的空箱塞得满溢，
他人の箱を横目に，
却侧视羡慕他人的箱子，
下手な愛想笑いすら　やっぱり出来てない，
就连蹩脚的客套笑容 果然都做不出来，
こんな空欄さえなければ　あなたも思うでしょう，
如果人生没有这样的空栏 你也会这样想的吧，
このままでいいなんて　それだけは間違いだ，
现状就好什么的 只有这点是错误的啊，
空っぽなんだ　ひとつも無いんだ，
答卷空白 没有痕迹，
無くなったのか　始まったのか分からないけど，
究竟是失去还是开始 纵使未曾明白，
行くしか方法は無いんだろう？
可除了继续也没有其他办法了吧？
正解がなんだ　価値なんて無いんだ，
所谓正确答案 没有一丝价值，
あたしは生涯　あたし以外じゃ生きられないよ，
但我今生今世 都只是我啊，
これ以上かき乱しても明日はない，
再继续涂写下去 也没有明日，
どう足掻いても明日はない，
无论如何挣扎都没有明天。`];

//处理翻译
translation.forEach((item, index) => {
    if (item != '') {
        translation[index] = item.replace(/[，。]/g, '');
        let transArr = translation[index].split('\n');
        translation[index] = [];
        for (let i = 0; i < transArr.length; i++) {
            if (i < foreign[index]) {
                translation[index].push(transArr[i]);
            }
            else {
                translation[index].push(transArr[i] + '<br>' + transArr[i + 1]);
                i++;
            }
        }
    }
});

//处理歌词
function handleLrc(lrc, index) {
    let time = [], lyrics = [], showTime = [];
    const regex = /^\[(\d{2}):(\d{2})\.(\d{1,})\]/;
    lrc = lrc.split('\n');
    time.push(0), lyrics.push(''), showTime.push('');
    for (let i = 0; i < lrc.length; i++) {
        const match = lrc[i].match(regex);
        if (match) {
            const min = Number(match[1]);
            const sec = Number(match[2]);
            const msec = Number(match[3]) / (10 ** match[3].length);
            let content;
            if (foreign[index] == 0) {
                content = lrc[i].replace(regex, '');
            }
            else {
                content = translation[index][i];
            }
            if (content != '') {
                time.push(min * 60 + sec + msec);
                lyrics.push(content);
                let timeText;
                if (sec < 10) {
                    timeText = min + ':0' + sec;
                }
                else {
                    timeText = min + ':' + sec;
                }
                if (min < 10) {
                    timeText = '0' + timeText;
                }
                showTime.push(timeText);
            }
        }
    }
    time.push(1e9);
    return { time, lyrics, showTime, size: time.length - 2 };
}
lrc.forEach((item, index) => {
    let result = handleLrc(item, index);
    time.push(result.time);
    lyrics.push(result.lyrics);
    showTime.push(result.showTime);
    size.push(result.size);
})
